Tekla Open API Reference for Tekla Structures 2025
RebarSet.CloseShape Property
 Gets or sets a value indicating whether disconnected bar legs should be connected where possible to form a closed shape.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool CloseShape { get; set; }
Public Property CloseShape As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RebarSet Class
Tekla.Structures.Model Namespace